In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df= pd.read_csv(r"C:\Users\MR.INDIA\Desktop\Bengaluru_House_Data.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
# df[45:66]
df.shape

(13320, 9)

In [4]:
df.area_type.unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [5]:
df.society.unique()

array(['Coomee ', 'Theanmp', nan, ..., 'SJovest', 'ThhtsV ', 'RSntsAp'],
      dtype=object)

In [6]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
area_type       13320 non-null object
availability    13320 non-null object
location        13319 non-null object
size            13304 non-null object
society         7818 non-null object
total_sqft      13320 non-null object
bath            13247 non-null float64
balcony         12711 non-null float64
price           13320 non-null float64
dtypes: float64(3), object(6)
memory usage: 624.4+ KB

In [8]:
df.area_type.value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [9]:
df.society.value_counts()

GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Tantsod     1
GKowsea     1
Juclend     1
Vicony      1
Rathira     1
Name: society, Length: 2688, dtype: int64

# Drop features that are not required to build our model

In [10]:
df2 = df.drop(["area_type","availability",'society','balcony'],axis="columns")
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [11]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

### Data Cleaning: Handle NA values

In [12]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [13]:
df2.bath.median()

2.0

In [14]:
df2.bath= df2.bath.median()

In [15]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath           0
price          0
dtype: int64

In [16]:
df3=df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [17]:
df3['BHK_size'] = df3["size"].apply(lambda x: int(x.split(' ')[0]))
df3.BHK_size.unique()

c:\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [18]:
df3[df3.BHK_size>15]

,location,size,total_sqft,bath,price,BHK_size
1718,2Electronic City Phase II,27 BHK,8000,2.0,230.0,27
3379,1Hanuman Nagar,19 BHK,2000,2.0,490.0,19
3609,Koramangala Industrial Layout,16 BHK,10000,2.0,550.0,16
4684,Munnekollal,43 Bedroom,2400,2.0,660.0,43
11559,1Kasavanhalli,18 Bedroom,1200,2.0,200.0,18

In [19]:
df3.total_sqft.unique()
df3.head()

                   location       size total_sqft  bath   price  BHK_size
0  Electronic City Phase II      2 BHK       1056   2.0   39.07         2
1          Chikka Tirupathi  4 Bedroom       2600   2.0  120.00         4
2               Uttarahalli      3 BHK       1440   2.0   62.00         3
3        Lingadheeranahalli      3 BHK       1521   2.0   95.00         3
4                  Kothanur      2 BHK       1200   2.0   51.00         2

In [20]:
def is_float(x):
    try:
        float (x)
    except:
        return False
    return True

In [21]:
df3[~df3["total_sqft"].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  BHK_size
30            Yelahanka      4 BHK     2100 - 2850   2.0  186.000         4
56          Devanahalli  4 Bedroom     3010 - 3410   2.0  192.000         4
81          Hennur Road  4 Bedroom     2957 - 3450   2.0  224.500         4
122              Hebbal      4 BHK     3067 - 8156   2.0  477.000         4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005         2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490         2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800         2
224         Devanahalli      3 BHK     1520 - 1740   2.0   74.820         3
410             Kengeri      1 BHK  34.46Sq. Meter   2.0   18.500         1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770         2

In [22]:
def convertSqftToNum(x):
    tokens = x.split('-')
    if len(tokens)==2:
        return (float(tokens[0]) + float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [23]:
convertSqftToNum('2100 - 2850')

2475.0

In [24]:
convertSqftToNum('34.46Sq. Meter')

In [25]:
convertSqftToNum('1056')

1056.0

In [26]:
df4=df3.copy()
df4['total_sqft'] = df4["total_sqft"].apply(convertSqftToNum)

In [27]:
df4.loc[30]

location      Yelahanka
size              4 BHK
total_sqft         2475
bath                  2
price               186
BHK_size              4
Name: 30, dtype: object

In [28]:
df4.head()

                   location       size  total_sqft  bath   price  BHK_size
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07         2
1          Chikka Tirupathi  4 Bedroom      2600.0   2.0  120.00         4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00         3
3        Lingadheeranahalli      3 BHK      1521.0   2.0   95.00         3
4                  Kothanur      2 BHK      1200.0   2.0   51.00         2

In [29]:
df5=df4.copy()
df5['price_per_sqft']= df5['price'] * 100000/df5['total_sqft']
df5.head()

,location,size,total_sqft,bath,price,BHK_size,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,2.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,2.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [30]:
len(df5.location.unique())

1304